# CurveByPointsProjectionType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveByPointsProjectionType Property
ParameterTypeId Class See Also
---
"Projection Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveByPointsProjectionType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveByPointsProjectionType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveByPointsProjectionType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace